## Final Project Submission

Please fill out:
* Student name: Gerardo Hernández
* Student pace: part time
* Scheduled project review date/time: 
* Instructor name: James Irving
* Blog post URL: gerardothr.com/blog/kings-county-house

In [1]:
# Your code here - remember to use markdown cells for comments as well!

### Project goal: identify attributes that result in the highest sale price throughout the year for digital advertising purposes

Importing necessary libraries:

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

Load the data set into a DataFrame:

In [3]:
df = pd.read_csv('kc_house_data.csv')

Investigating the dataset:

In [4]:
df.head() # Preview the dataset

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,7129300520,10/13/2014,221900.0,3,1.00,1180,5650,1.0,NaN,0.0,...,7,1180,0.0,1955,0.0,98178,47.5112,-122.257,1340,5650
1,6414100192,12/9/2014,538000.0,3,2.25,2570,7242,2.0,0.0,0.0,...,7,2170,400.0,1951,1991.0,98125,47.7210,-122.319,1690,7639
2,5631500400,2/25/2015,180000.0,2,1.00,770,10000,1.0,0.0,0.0,...,6,770,0.0,1933,NaN,98028,47.7379,-122.233,2720,8062
3,2487200875,12/9/2014,604000.0,4,3.00,1960,5000,1.0,0.0,0.0,...,7,1050,910.0,1965,0.0,98136,47.5208,-122.393,1360,5000
4,1954400510,2/18/2015,510000.0,3,2.00,1680,8080,1.0,0.0,0.0,...,8,1680,0.0,1987,0.0,98074,47.6168,-122.045,1800,7503

In [5]:
df.tail()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
21592,263000018,5/21/2014,360000.0,3,2.50,1530,1131,3.0,0.0,0.0,...,8,1530,0.0,2009,0.0,98103,47.6993,-122.346,1530,1509
21593,6600060120,2/23/2015,400000.0,4,2.50,2310,5813,2.0,0.0,0.0,...,8,2310,0.0,2014,0.0,98146,47.5107,-122.362,1830,7200
21594,1523300141,6/23/2014,402101.0,2,0.75,1020,1350,2.0,0.0,0.0,...,7,1020,0.0,2009,0.0,98144,47.5944,-122.299,1020,2007
21595,291310100,1/16/2015,400000.0,3,2.50,1600,2388,2.0,NaN,0.0,...,8,1600,0.0,2004,0.0,98027,47.5345,-122.069,1410,1287
21596,1523300157,10/15/2014,325000.0,2,0.75,1020,1076,2.0,0.0,0.0,...,7,1020,0.0,2008,0.0,98144,47.5941,-122.299,1020,1357

In [6]:
# Get summary of dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21597 entries, 0 to 21596
Data columns (total 21 columns):
id               21597 non-null int64
date             21597 non-null object
price            21597 non-null float64
bedrooms         21597 non-null int64
bathrooms        21597 non-null float64
sqft_living      21597 non-null int64
sqft_lot         21597 non-null int64
floors           21597 non-null float64
waterfront       19221 non-null float64
view             21534 non-null float64
condition        21597 non-null int64
grade            21597 non-null int64
sqft_above       21597 non-null int64
sqft_basement    21597 non-null object
yr_built         21597 non-null int64
yr_renovated     17755 non-null float64
zipcode          21597 non-null int64
lat              21597 non-null float64
long             21597 non-null float64
sqft_living15    21597 non-null int64
sqft_lot15       21597 non-null int64
dtypes: float64(8), int64(11), object(2)
memory usage: 3.5+ MB

In [7]:
# Overview of statistics for data
df.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
count,2.159700e+04,2.159700e+04,21597.000000,21597.000000,21597.000000,2.159700e+04,21597.000000,19221.000000,21534.000000,21597.000000,21597.000000,21597.000000,21597.000000,17755.000000,21597.000000,21597.000000,21597.000000,21597.000000,21597.000000
mean,4.580474e+09,5.402966e+05,3.373200,2.115826,2080.321850,1.509941e+04,1.494096,0.007596,0.233863,3.409825,7.657915,1788.596842,1970.999676,83.636778,98077.951845,47.560093,-122.213982,1986.620318,12758.283512
std,2.876736e+09,3.673681e+05,0.926299,0.768984,918.106125,4.141264e+04,0.539683,0.086825,0.765686,0.650546,1.173200,827.759761,29.375234,399.946414,53.513072,0.138552,0.140724,685.230472,27274.441950
min,1.000102e+06,7.800000e+04,1.000000,0.500000,370.000000,5.200000e+02,1.000000,0.000000,0.000000,1.000000,3.000000,370.000000,1900.000000,0.000000,98001.000000,47.155900,-122.519000,399.000000,651.000000
25%,2.123049e+09,3.220000e+05,3.000000,1.750000,1430.000000,5.040000e+03,1.000000,0.000000,0.000000,3.000000,7.000000,1190.000000,1951.000000,0.000000,98033.000000,47.471100,-122.328000,1490.000000,5100.000000
50%,3.904930e+09,4.500000e+05,3.000000,2.250000,1910.000000,7.618000e+03,1.500000,0.000000,0.000000,3.000000,7.000000,1560.000000,1975.000000,0.000000,98065.000000,47.571800,-122.231000,1840.000000,7620.000000
75%,7.308900e+09,6.450000e+05,4.000000,2.500000,2550.000000,1.068500e+04,2.000000,0.000000,0.000000,4.000000,8.000000,2210.000000,1997.000000,0.000000,98118.000000,47.678000,-122.125000,2360.000000,10083.000000
max,9.900000e+09,7.700000e+06,33.000000,8.000000,13540.000000,1.651359e+06,3.500000,1.000000,4.000000,5.000000,13.000000,9410.000000,2015.000000,2015.000000,98199.000000,47.777600,-121.315000,6210.000000,871200.000000

In [8]:
# Search for null values
df.isna().sum()

id                  0
date                0
price               0
bedrooms            0
bathrooms           0
sqft_living         0
sqft_lot            0
floors              0
waterfront       2376
view               63
condition           0
grade               0
sqft_above          0
sqft_basement       0
yr_built            0
yr_renovated     3842
zipcode             0
lat                 0
long                0
sqft_living15       0
sqft_lot15          0
dtype: int64

In [9]:
# Print unique values for each column
for i in df.columns:
    print(f"{i}: {df[i].nunique()}")

id: 21420
date: 372
price: 3622
bedrooms: 12
bathrooms: 29
sqft_living: 1034
sqft_lot: 9776
floors: 6
waterfront: 2
view: 5
condition: 5
grade: 11
sqft_above: 942
sqft_basement: 304
yr_built: 116
yr_renovated: 70
zipcode: 70
lat: 5033
long: 751
sqft_living15: 777
sqft_lot15: 8682

### Initial observations:
1. `date`, `yr_built`, and `yr_renovated` need to be in datetime format
2. The `yr_renovated` column `NaN`s most likely mean that the house has not been renovated since being built
3. The `waterfront` column seems to be binary with a some missing values, so type should be boolean and missing values can be dropped
4. The `view` column it appears to be a ranking, missing values can be dropped

In [10]:
df['date'].head()

0    10/13/2014
1     12/9/2014
2     2/25/2015
3     12/9/2014
4     2/18/2015
Name: date, dtype: object

In [11]:
df['yr_built'].head()

0    1955
1    1951
2    1933
3    1965
4    1987
Name: yr_built, dtype: int64

In [12]:
df['yr_renovated'].head()

0       0.0
1    1991.0
2       NaN
3       0.0
4       0.0
Name: yr_renovated, dtype: float64

In [13]:
import datetime

In [14]:
# Convert 'date' column to datetime
df['date'] = df.date.map(lambda x: datetime.datetime.strptime(x, '%m/%d/%Y'))

In [15]:
# Verify conversion from string to datetime
df.date.head()

0   2014-10-13
1   2014-12-09
2   2015-02-25
3   2014-12-09
4   2015-02-18
Name: date, dtype: datetime64[ns]

In [16]:
# Make new column 'month_name' with full month name from 'date'
df['month_name'] = df['date'].map(lambda x: x.strftime('%B'))
df.month_name.head() # verify new column

0     October
1    December
2    February
3    December
4    February
Name: month_name, dtype: object

In [17]:
# Make new column 'yr_sold' with year from 'date'
df['yr_sold'] = df['date'].map(lambda x: x.strftime('%Y'))
df.yr_sold.head() # verify new column

0    2014
1    2014
2    2015
3    2014
4    2015
Name: yr_sold, dtype: object

In [18]:
# Convert 'yr_built' to datetime
df['yr_built'] = df.yr_built.map(lambda x: datetime.datetime.strptime(str(x), '%Y'))
df['yr_built'] = df.yr_built.map(lambda x: x.strftime('%Y')) # Isolate Year
df.yr_built.head() # verify conversion

0    1955
1    1951
2    1933
3    1965
4    1987
Name: yr_built, dtype: object

In [19]:
# Check values in 'yr_renovated'
df.yr_renovated.unique()

array([   0., 1991.,   nan, 2002., 2010., 1992., 2013., 1994., 1978.,
       2005., 2003., 1984., 1954., 2014., 2011., 1983., 1945., 1990.,
       1988., 1977., 1981., 1995., 2000., 1999., 1998., 1970., 1989.,
       2004., 1986., 2007., 1987., 2006., 1985., 2001., 1980., 1971.,
       1979., 1997., 1950., 1969., 1948., 2009., 2015., 1974., 2008.,
       1968., 2012., 1963., 1951., 1962., 1953., 1993., 1996., 1955.,
       1982., 1956., 1940., 1976., 1946., 1975., 1964., 1973., 1957.,
       1959., 1960., 1967., 1965., 1934., 1972., 1944., 1958.])

In [20]:
# What are these Year 0s?
print(df[df['yr_renovated']==0].info())
print(df[df['yr_renovated'].isna()].info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17011 entries, 0 to 21596
Data columns (total 23 columns):
id               17011 non-null int64
date             17011 non-null datetime64[ns]
price            17011 non-null float64
bedrooms         17011 non-null int64
bathrooms        17011 non-null float64
sqft_living      17011 non-null int64
sqft_lot         17011 non-null int64
floors           17011 non-null float64
waterfront       15157 non-null float64
view             16961 non-null float64
condition        17011 non-null int64
grade            17011 non-null int64
sqft_above       17011 non-null int64
sqft_basement    17011 non-null object
yr_built         17011 non-null object
yr_renovated     17011 non-null float64
zipcode          17011 non-null int64
lat              17011 non-null float64
long             17011 non-null float64
sqft_living15    17011 non-null int64
sqft_lot15       17011 non-null int64
month_name       17011 non-null object
yr_sold          17011 non-null object
dtypes: datetime64[ns](1), float64(8), int64(10), object(4)
memory usage: 3.1+ MB
None
<class 'pandas.core.frame.DataFrame'>
Int64Index: 3842 entries, 2 to 21583
Data columns (total 23 columns):
id               3842 non-null int64
date             3842 non-null datetime64[ns]
price            3842 non-null float64
bedrooms         3842 non-null int64
bathrooms        3842 non-null float64
sqft_living      3842 non-null int64
sqft_lot         3842 non-null int64
floors           3842 non-null float64
waterfront       3412 non-null float64
view             3830 non-null float64
condition        3842 non-null int64
grade            3842 non-null int64
sqft_above       3842 non-null int64
sqft_basement    3842 non-null object
yr_built         3842 non-null object
yr_renovated     0 non-null float64
zipcode          3842 non-null int64
lat              3842 non-null float64
long             3842 non-null float64
sqft_living15    3842 non-null int64
sqft_lot15       3842 non-null int64
month_name       3842 non-null object
yr_sold          3842 non-null object
dtypes: datetime64[ns](1), float64(8), int64(10), object(4)
memory usage: 720.4+ KB
None

Unsure of what NaN means in `yr_renovated` column, will replace with 0 since we can't advertise it either way

In [21]:
# Replace NaN in 'yr_renovated' with 0.
df['yr_renovated'] = df.yr_renovated.fillna(0.)
df.yr_renovated.isna().sum() # verify

0

In [22]:
# Create an 'is_renovated' column
df.loc[df['yr_renovated']==0., 'is_renovated'] = False
df.loc[df['yr_renovated']>0., 'is_renovated'] = True
# Print summary of column
print(f"Renovated: {df[df['is_renovated']==True].shape[0]}")
print(f"Not renovated: {df[df['is_renovated']==False].shape[0]}")

Renovated: 744
Not renovated: 20853

In [23]:
# 'yr_renovated' to int
df['yr_renovated'] = df.yr_renovated.map(lambda x: int(x))
df['yr_renovated'].unique()

array([   0, 1991, 2002, 2010, 1992, 2013, 1994, 1978, 2005, 2003, 1984,
       1954, 2014, 2011, 1983, 1945, 1990, 1988, 1977, 1981, 1995, 2000,
       1999, 1998, 1970, 1989, 2004, 1986, 2007, 1987, 2006, 1985, 2001,
       1980, 1971, 1979, 1997, 1950, 1969, 1948, 2009, 2015, 1974, 2008,
       1968, 2012, 1963, 1951, 1962, 1953, 1993, 1996, 1955, 1982, 1956,
       1940, 1976, 1946, 1975, 1964, 1973, 1957, 1959, 1960, 1967, 1965,
       1934, 1972, 1944, 1958])

In [24]:
# replace 0 with 9999 for %Y to work
df.loc[df['yr_renovated']==0, 'yr_renovated'] = '9999'
df.yr_renovated.unique()

array(['9999', 1991, 2002, 2010, 1992, 2013, 1994, 1978, 2005, 2003, 1984,
       1954, 2014, 2011, 1983, 1945, 1990, 1988, 1977, 1981, 1995, 2000,
       1999, 1998, 1970, 1989, 2004, 1986, 2007, 1987, 2006, 1985, 2001,
       1980, 1971, 1979, 1997, 1950, 1969, 1948, 2009, 2015, 1974, 2008,
       1968, 2012, 1963, 1951, 1962, 1953, 1993, 1996, 1955, 1982, 1956,
       1940, 1976, 1946, 1975, 1964, 1973, 1957, 1959, 1960, 1967, 1965,
       1934, 1972, 1944, 1958], dtype=object)

In [25]:
# 'yr_renovated' to datetime
df['yr_renovated'] = df.yr_renovated.map(lambda x: datetime.datetime.strptime(str(x), '%Y'))
df['yr_renovated'] = df.yr_renovated.map(lambda x: x.strftime('%Y')) # Isolate Year
df.yr_renovated.head() # verify conversion

0    9999
1    1991
2    9999
3    9999
4    9999
Name: yr_renovated, dtype: object

In [26]:
# how to best deal with NaN in 'waterfront
df['waterfront'].unique()

array([nan,  0.,  1.])

In [27]:
df.loc[df['waterfront']==1., 'waterfront'] = True
df.loc[df['waterfront']==0., 'waterfront'] = False

In [28]:
print(f"Waterfront: {df['waterfront'].sum()}")
print(f"Not Waterfront: {df[df['waterfront']==False].shape[0]}")
print(f"NaN: {df['waterfront'].isna().sum()}")

Waterfront: 146
Not Waterfront: 19075
NaN: 2376

Same as with `yr_renovated` column, will replace with NaN with False since we can't advertise them as waterfront properties

In [29]:
df['waterfront'].fillna(False, inplace=True)
df.waterfront.isna().sum()

0

In [30]:
sns.lmplot(x=df.date.dt.month, y='price', data=df)

TypeError: invalid type comparison